regression2/t_writes-innodb-multi/mysql-8.0.15-nobinlog/sysbench.128.res
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Report intermediate results every 3 second(s)
Random number generator seed is 0 and will be ignored

Forcing shutdown in 181 seconds

Threads started!

[   3s] threads: 128, tps: 9065.20, reads: 0.00, writes: 181966.56, response time: 26.17ms (95%), errors: 17.33, reconnects:  0.00
[   6s] threads: 128, tps: 9067.22, reads: 0.00, writes: 181470.98, response time: 25.15ms (95%), errors: 19.33, reconnects:  0.00
[   9s] threads: 128, tps: 9086.99, reads: 0.00, writes: 181976.48, response time: 24.46ms (95%), errors: 15.33, reconnects:  0.00
[  12s] threads: 128, tps: 9222.34, reads: 0.00, writes: 184786.42, response time: 24.72ms (95%), errors: 19.00, reconnects:  0.00
[  15s] threads: 128, tps: 8873.63, reads: 0.00, writes: 177465.84, response time: 26.34ms (95%), errors: 16.33, reconnects:  0.00
[  18s] threads: 128, tps: 9062.72, reads: 0.00, writes: 181703.98, response time: 25.69ms (95%), errors: 17.33, reconnects:  0.00
[  21s] threads: 128, tps: 9450.00, reads: 0.00, writes: 188934.28, response time: 24.29ms (95%), errors: 23.00, reconnects:  0.00
[  24s] threads: 128, tps: 9214.33, reads: 0.00, writes: 184440.89, response time: 25.30ms (95%), errors: 18.67, reconnects:  0.00
[  27s] threads: 128, tps: 9492.34, reads: 0.00, writes: 189909.11, response time: 24.50ms (95%), errors: 18.67, reconnects:  0.00
[  30s] threads: 128, tps: 9497.99, reads: 0.00, writes: 190241.86, response time: 24.32ms (95%), errors: 18.33, reconnects:  0.00
[  33s] threads: 128, tps: 9327.55, reads: 0.00, writes: 186737.37, response time: 24.29ms (95%), errors: 16.33, reconnects:  0.00
[  36s] threads: 128, tps: 9161.78, reads: 0.00, writes: 183451.32, response time: 25.14ms (95%), errors: 19.00, reconnects:  0.00
[  39s] threads: 128, tps: 9399.65, reads: 0.00, writes: 188191.36, response time: 24.59ms (95%), errors: 20.67, reconnects:  0.00
[  42s] threads: 128, tps: 9257.68, reads: 0.00, writes: 185273.86, response time: 24.64ms (95%), errors: 18.33, reconnects:  0.00
[  45s] threads: 128, tps: 9489.33, reads: 0.00, writes: 190000.36, response time: 23.74ms (95%), errors: 17.67, reconnects:  0.00
[  48s] threads: 128, tps: 9525.67, reads: 0.00, writes: 190739.32, response time: 23.84ms (95%), errors: 23.67, reconnects:  0.00
[  51s] threads: 128, tps: 9269.67, reads: 0.00, writes: 185890.08, response time: 25.15ms (95%), errors: 17.33, reconnects:  0.00
[  54s] threads: 128, tps: 9559.33, reads: 0.00, writes: 191124.24, response time: 23.68ms (95%), errors: 20.33, reconnects:  0.00
[  57s] threads: 128, tps: 9444.67, reads: 0.00, writes: 189000.97, response time: 24.32ms (95%), errors: 18.33, reconnects:  0.00
[  60s] threads: 128, tps: 9465.33, reads: 0.00, writes: 189543.33, response time: 24.15ms (95%), errors: 18.67, reconnects:  0.00
[  63s] threads: 128, tps: 9493.00, reads: 0.00, writes: 189970.66, response time: 24.24ms (95%), errors: 23.00, reconnects:  0.00
[  66s] threads: 128, tps: 9243.01, reads: 0.00, writes: 185173.17, response time: 25.27ms (95%), errors: 22.33, reconnects:  0.00
[  69s] threads: 128, tps: 9476.00, reads: 0.00, writes: 189783.98, response time: 23.78ms (95%), errors: 20.00, reconnects:  0.00
[  72s] threads: 128, tps: 9364.05, reads: 0.00, writes: 187736.34, response time: 24.11ms (95%), errors: 16.00, reconnects:  0.00
[  75s] threads: 128, tps: 9178.63, reads: 0.00, writes: 183735.58, response time: 24.01ms (95%), errors: 16.67, reconnects:  0.00
[  78s] threads: 128, tps: 9423.65, reads: 0.00, writes: 188560.33, response time: 24.00ms (95%), errors: 23.33, reconnects:  0.00
[  81s] threads: 128, tps: 9216.33, reads: 0.00, writes: 184444.63, response time: 24.76ms (95%), errors: 19.00, reconnects:  0.00
[  84s] threads: 128, tps: 9409.67, reads: 0.00, writes: 188437.08, response time: 24.29ms (95%), errors: 17.33, reconnects:  0.00
[  87s] threads: 128, tps: 9226.00, reads: 0.00, writes: 184709.64, response time: 24.91ms (95%), errors: 20.67, reconnects:  0.00
[  90s] threads: 128, tps: 9327.67, reads: 0.00, writes: 186561.07, response time: 23.99ms (95%), errors: 22.33, reconnects:  0.00
[  93s] threads: 128, tps: 9487.99, reads: 0.00, writes: 190296.88, response time: 23.79ms (95%), errors: 22.00, reconnects:  0.00
[  96s] threads: 128, tps: 9437.68, reads: 0.00, writes: 188941.31, response time: 23.95ms (95%), errors: 14.33, reconnects:  0.00
[  99s] threads: 128, tps: 9464.66, reads: 0.00, writes: 189434.79, response time: 23.80ms (95%), errors: 23.33, reconnects:  0.00
[ 102s] threads: 128, tps: 9464.66, reads: 0.00, writes: 189012.97, response time: 24.09ms (95%), errors: 14.67, reconnects:  0.00
[ 105s] threads: 128, tps: 9278.00, reads: 0.00, writes: 185909.57, response time: 24.85ms (95%), errors: 17.67, reconnects:  0.00
[ 108s] threads: 128, tps: 9521.68, reads: 0.00, writes: 190675.22, response time: 23.63ms (95%), errors: 19.33, reconnects:  0.00
[ 111s] threads: 128, tps: 9269.29, reads: 0.00, writes: 185716.43, response time: 24.60ms (95%), errors: 18.00, reconnects:  0.00
[ 114s] threads: 128, tps: 9383.03, reads: 0.00, writes: 187650.92, response time: 24.54ms (95%), errors: 18.33, reconnects:  0.00
[ 117s] threads: 128, tps: 9398.01, reads: 0.00, writes: 188221.49, response time: 24.24ms (95%), errors: 20.00, reconnects:  0.00
[ 120s] threads: 128, tps: 9173.00, reads: 0.00, writes: 183539.72, response time: 24.48ms (95%), errors: 19.67, reconnects:  0.00
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           22603276
        other:                           2260376
        total:                           24863652
    transactions:                        1129038 (9330.31 per sec.)
    read/write requests:                 22603276 (186792.19 per sec.)
    other operations:                    2260376 (18679.62 per sec.)
    ignored errors:                      2300   (19.01 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          121.0076s
    total number of events:              1129038
    total time taken by event execution: 15485.6230s
    response time:
         min:                                  2.59ms
         avg:                                 13.72ms
         max:                                141.28ms
         approx.  95 percentile:              24.48ms

Threads fairness:
    events (avg/stddev):           8820.6094/38.25
    execution time (avg/stddev):   120.9814/0.02